app/helpers/application_helper.rb

  def fetch_salon_list
    SalonInfo.where("chair_count > ?", 0)&.pluck(:company_name, :id)
---
SELECT `salon_infos`.`company_name`, `salon_infos`.`id` FROM `salon_infos` WHERE (chair_count > 0)