app/controllers/appointments_controller.rb

SELECT `appointments`.* FROM `appointments`
---
  def index
    @appointments = Appointment.all

INSERT INTO `appointments` (`salon_info_id`, `salon_service_id`, `user_name`, `mobile`, `gender`, `start_time`, `created_at`, `updated_at`) VALUES (2, 1, 'vikesh', '8976320611', 'male', '10:30:00', '2022-08-10 11:41:34.322286', '2022-08-10 11:41:34.322286')
---
  def create
    @appointment = Appointment.new(appointment_params)
    if @appointment.save