app/controllers/salon_infos_controller.rb

SELECT `salon_infos`.* FROM `salon_infos`
---
  def index
    @salon_info = SalonInfo.new
    @salon_infos = SalonInfo.all

INSERT INTO `salon_infos` (`company_name`, `gstin`, `pan`, `address`, `chair_count`, `day`, `open`, `closes`, `created_at`, `updated_at`) VALUES ('roma', '37AADCS0472N1Z1', 'ALWPG5809L', 'navi mumbai', 2, 5, '09:00:00', '20:00:00', '2022-08-05 07:27:56.933174', '2022-08-05 07:27:56.933174')
---
  def create
    @salon_info = SalonInfo.create(salon_info_params)

SELECT `salon_infos`.* FROM `salon_infos` WHERE `salon_infos`.`id` = 2 LIMIT 1
SELECT `salon_services`.* FROM `salon_services` WHERE `salon_services`.`salon_info_id` = 2
---
  def get_salon_services
    salon_info = SalonInfo.find_by_id(params[:salon_info])
    salon_services_list = salon_info&.salon_services.map{|service| [service.id.to_s, service.service_type]}

SELECT `appointments`.* FROM `appointments` WHERE `appointments`.`salon_info_id` = 2 AND (DATE(created_at) = '2022-08-16')
---
  def fetch_available_slots(salon_info)
    time_slot_list = []
    duration = 30

    while (salon_info.open.strftime("%H:%M") <= salon_info.closes.strftime("%H:%M")) do
      time_slot_list << salon_info.open.strftime("%H:%M")
      salon_info.open += duration.minutes
    end

    result_array = []
    time_slot_list.each do |time|
      result = {}
      result[:count] = salon_info.chair_count
      result[:slot] = time
      result_array << result
    end

    appointment_result = []
    salon_info.appointments.where("DATE(created_at) = ?", Date.today).each do |appo|